layers{
  name: "default"
  type: HDF5_DATA
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "examples/cifar10/train.txt"
    batch_size: 100
  }
  transform_param {
    mean_file: "examples/cifar10/mean.binaryproto"
  }
  include: { phase: TRAIN }
}
layers{
  name: "default"
  type: HDF5_DATA
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "examples/cifar10/test.txt"
    batch_size: 100
  }
  include: { phase: TEST }
}
