layer{
  name: "default"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "train.txt"
    batch_size: 100
  }
  transform_param {
  }
  include: { phase: TRAIN }
}
layer{
  name: "default"
  type: "HDF5Data"
  top: "data"
  top: "label"
  hdf5_data_param {
    source: "test.txt"
    batch_size: 100
  }
  transform_param {
  }
  include: { phase: TEST }
}
